In [1]:
print("Hello World")
print("Merhaba Dünya")

Hello World
Merhaba Dünya

In [2]:
a = 5
a

5

## Pandas

Veri analizi ve veri manipülasyonu için kullanılan kütüphanedir.

In [5]:
import pandas as pd

## Pandas Series

Tek boyutlu bir dizidir. (Exceldeki tek bir sütun gibi düşünebiliriz.)

In [7]:
series1= pd.Series([10,20,30,40,50])
series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Pandas DataFrame (Tablo)
Birden fazla sütun içeren tablodur.(Excel dosyası)

In [16]:
data = {"Ad": ["Ali", "Ayşe", "Mehmet", "Zeynep"], "Yaş":[25,30,35,40], "Şehir": ["İstanbul", "İzmir", "Ankara", "Bursa"]}

In [20]:
df1 = pd.DataFrame(data)
df1

       Ad  Yaş     Şehir
0     Ali   25  İstanbul
1    Ayşe   30     İzmir
2  Mehmet   35    Ankara
3  Zeynep   40     Bursa

read.csv fonksiyonu bir cvs dosyasından DataFrame oluşturur.

In [24]:

df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [25]:
type(df2)

pandas.core.frame.DataFrame

In [26]:
type(df1)

pandas.core.frame.DataFrame

In [28]:
# son beş veri
df2.tail()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [29]:
# ilk beş veri
df2.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

rastgele n adet veriyi verir. n() -> default olarak n değeri 1 dir.

In [30]:
df2.sample(n=10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
602,Kelci Walkden,Australia,Raspberry Choco,07-Jun-22,$679,56
321,Jan Morforth,India,85% Dark Bars,25-May-22,"$4,760",418
804,Roddy Speechley,UK,Peanut Butter Cubes,17-Aug-22,"$5,691",171
68,Oby Sorrel,India,Organic Choco Syrup,08-Jul-22,"$6,181",56
26,Roddy Speechley,Canada,Spicy Special Slims,09-Feb-22,"$1,652",186
481,Beverie Moffet,New Zealand,Smooth Sliky Salty,19-May-22,"$2,387",59
1019,Brien Boise,Australia,Organic Choco Syrup,15-Jul-22,"$4,263",264
169,Ches Bonnell,Australia,White Choc,02-Mar-22,"$1,043",202
679,Kaine Padly,Canada,85% Dark Bars,06-Apr-22,"$1,729",31

In [31]:
df2["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [32]:
df2["Boxes Shipped"]

0       180
1        94
2        91
3       342
4       184
       ...
1089    323
1090    119
1091    217
1092    384
1093    344
Name: Boxes Shipped, Length: 1094, dtype: int64

In [34]:
df2[df2["Boxes Shipped"] > 300]

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
15,Beverie Moffet,Australia,Organic Choco Syrup,26-Jan-22,"$6,790",356
25,Karlen McCaffrey,India,Fruit & Nut Bars,26-Jan-22,$168,321
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
35,Roddy Speechley,USA,Manuka Honey Choco,22-Jul-22,"$9,583",315
...,...,...,...,...,...,...
1077,Oby Sorrel,Canada,Orange Choco,27-Apr-22,"$8,757",338
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [ ]:
# df2[df2["Amount"] > 300 ]    Amount int değil hata verir.

In [35]:
df2.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False          False
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [36]:
df2.isnull().any()

Sales Person     False
Country          False
Product          False
Date             False
Amount           False
Boxes Shipped    False
dtype: bool

In [37]:
df2.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

Ortalama mean() fonksiyonu ile alınır.

In [38]:
df2["Boxes Shipped"].mean()

np.float64(161.7979890310786)

En sık tekrarlayan değer mode() ile alınır.

In [41]:
df2["Country"].mean()

0    Australia
Name: Country, dtype: object

In [43]:
df2["Boxes Shipped"].median()

np.float64(135.0)

df2 Boxes Shipped'in boş alanlarını ortalaması ile doldur.

In [45]:
df2["Boxes Shipped"] = df2["Boxes Shipped"].fillna(df2["Boxes Shipped"].mean())